app/controllers/books_controller.rb

SELECT "books".* FROM "books"
---
  def index
  	@book = Book.new
  	 @lists = Book.all

INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "タイトル"], ["body", "a\r\n"], ["created_at", "2020-08-30 08:31:57.397192"], ["updated_at", "2020-08-30 08:31:57.397192"]]
SELECT "books".* FROM "books"
---
  def create
  	@book = Book.new(book_params)
    if @book.save
     flash[:success] = "Book was successfully created"
     redirect_to book_path(@book)
 else
 	@lists = Book.all

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["title", "Ruby"], ["body", "Rubyyyyyy"], ["updated_at", "2020-08-30 06:02:37.090361"], ["id", 1]]
---
  def update
  	@book = Book.find(params[:id])
  	if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 19]]
---
  def destroy
  	book = Book.find(params[:id])
  	book.destroy